wrk8/wrk_4003_w_Heavy.txt
wrk -t 3 -c 3 -d180 -R 50 -math 1 --latency http://13.0.0.29:8081/high/web350m.html
Running 3m test @ http://13.0.0.29:8081/high/web350m.html
  1 threads and 1 connections
  Thread calibration: mean lat.: 9223372036854776.000ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.56m     0.85m    2.95m    60.00%
    Req/Sec     0.00      0.00     0.00    100.00%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    93847.55 ms
 75.000%    129564.67 ms
 90.000%    165150.72 ms
 99.000%    177340.42 ms
 99.900%    177340.42 ms
 99.990%    177340.42 ms
 99.999%    177340.42 ms
100.000%    177340.42 ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

   10182.655     0.000000            1         1.00
   22462.463     0.100000            2         1.11
   34668.543     0.200000            3         1.25
   59113.471     0.300000            5         1.43
   70320.127     0.400000            6         1.67
   93847.551     0.500000            8         2.00
  106168.319     0.550000            9         2.22
  106168.319     0.600000            9         2.50
  117440.511     0.650000           10         2.86
  129564.671     0.700000           11         3.33
  141033.471     0.750000           12         4.00
  141033.471     0.775000           12         4.44
  141033.471     0.800000           12         5.00
  152305.663     0.825000           13         5.71
  152305.663     0.850000           13         6.67
  165150.719     0.875000           14         8.00
  165150.719     0.887500           14         8.89
  165150.719     0.900000           14        10.00
  165150.719     0.912500           14        11.43
  165150.719     0.925000           14        13.33
  177340.415     0.937500           15        16.00
  177340.415     1.000000           15          inf
#[Mean    =    93898.615, StdDeviation   =    51217.866]
#[Max     =   177209.344, Total count    =           15]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------

  Latency Distribution (HdrHistogram - Uncorrected Latency (measured without taking delayed starts into account))
 50.000%    9977.85 ms
 75.000%    9986.05 ms
 90.000%    10182.66 ms
 99.000%    10575.87 ms
 99.900%    10575.87 ms
 99.990%    10575.87 ms
 99.999%    10575.87 ms
100.000%    10575.87 ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

    9879.551     0.000000            1         1.00
    9912.319     0.100000            2         1.11
    9928.703     0.200000            3         1.25
    9953.279     0.300000            6         1.43
    9953.279     0.400000            6         1.67
    9977.855     0.500000            9         2.00
    9977.855     0.550000            9         2.22
    9977.855     0.600000            9         2.50
    9986.047     0.650000           11         2.86
    9986.047     0.700000           11         3.33
    9994.239     0.750000           12         4.00
    9994.239     0.775000           12         4.44
    9994.239     0.800000           12         5.00
   10059.775     0.825000           13         5.71
   10059.775     0.850000           13         6.67
   10182.655     0.875000           14         8.00
   10182.655     0.887500           14         8.89
   10182.655     0.900000           14        10.00
   10182.655     0.912500           14        11.43
   10182.655     0.925000           14        13.33
   10575.871     0.937500           15        16.00
   10575.871     1.000000           15          inf
#[Mean    =    10013.628, StdDeviation   =      163.782]
#[Max     =    10567.680, Total count    =           15]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  15 requests in 3.01m, 5.20GB read
  Socket errors: connect 0, read 0, write 0, timeout 64
Requests/sec:      0.08
Transfer/sec:     29.43MB
Running 3m test @ http://13.0.0.29:8081/high/web350m.html
  1 threads and 1 connections
  Thread calibration: mean lat.: 9981.952ms, rate sampling interval: 19972ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.66m    47.60s    2.94m    57.14%
    Req/Sec     0.00      0.00     0.00    100.00%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    93650.94 ms
 75.000%    140771.33 ms
 90.000%    164626.43 ms
 99.000%    176685.05 ms
 99.900%    176685.05 ms
 99.990%    176685.05 ms
 99.999%    176685.05 ms
100.000%    176685.05 ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

   22233.087     0.000000            1         1.00
   34439.167     0.100000            2         1.11
   46628.863     0.200000            3         1.25
   70189.055     0.300000            5         1.43
   82444.287     0.400000            6         1.67
   93650.943     0.500000            7         2.00
  105971.711     0.550000            8         2.22
  117178.367     0.600000            9         2.50
  129433.599     0.650000           10         2.86
  129433.599     0.700000           10         3.33
  140771.327     0.750000           11         4.00
  140771.327     0.775000           11         4.44
  152174.591     0.800000           12         5.00
  152174.591     0.825000           12         5.71
  152174.591     0.850000           12         6.67
  164626.431     0.875000           13         8.00
  164626.431     0.887500           13         8.89
  164626.431     0.900000           13        10.00
  164626.431     0.912500           13        11.43
  164626.431     0.925000           13        13.33
  176685.055     0.937500           14        16.00
  176685.055     1.000000           14          inf
#[Mean    =    99635.200, StdDeviation   =    47604.656]
#[Max     =   176553.984, Total count    =           14]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------

  Latency Distribution (HdrHistogram - Uncorrected Latency (measured without taking delayed starts into account))
 50.000%    9953.28 ms
 75.000%    9977.85 ms
 90.000%    10035.20 ms
 99.000%    10092.54 ms
 99.900%    10092.54 ms
 99.990%    10092.54 ms
 99.999%    10092.54 ms
100.000%    10092.54 ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

    9789.439     0.000000            1         1.00
    9838.591     0.100000            2         1.11
    9912.319     0.200000            3         1.25
    9928.703     0.300000            5         1.43
    9945.087     0.400000            6         1.67
    9953.279     0.500000            8         2.00
    9953.279     0.550000            8         2.22
    9961.471     0.600000            9         2.50
    9969.663     0.650000           10         2.86
    9969.663     0.700000           10         3.33
    9977.855     0.750000           12         4.00
    9977.855     0.775000           12         4.44
    9977.855     0.800000           12         5.00
    9977.855     0.825000           12         5.71
    9977.855     0.850000           12         6.67
   10035.199     0.875000           13         8.00
   10035.199     0.887500           13         8.89
   10035.199     0.900000           13        10.00
   10035.199     0.912500           13        11.43
   10035.199     0.925000           13        13.33
   10092.543     0.937500           14        16.00
   10092.543     1.000000           14          inf
#[Mean    =     9943.333, StdDeviation   =       70.771]
#[Max     =    10084.352, Total count    =           14]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  15 requests in 3.00m, 5.20GB read
  Socket errors: connect 0, read 0, write 0, timeout 64
Requests/sec:      0.08
Transfer/sec:     29.56MB
Running 3m test @ http://13.0.0.29:8081/high/web350m.html
  1 threads and 1 connections
  Thread calibration: mean lat.: 9990.144ms, rate sampling interval: 19988ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.66m    47.65s    2.95m    57.14%
    Req/Sec     0.00      0.00     0.00    100.00%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    93847.55 ms
 75.000%    141033.47 ms
 90.000%    164626.43 ms
 99.000%    176947.20 ms
 99.900%    176947.20 ms
 99.990%    176947.20 ms
 99.999%    176947.20 ms
100.000%    176947.20 ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

   22282.239     0.000000            1         1.00
   34471.935     0.100000            2         1.11
   46759.935     0.200000            3         1.25
   70254.591     0.300000            5         1.43
   82575.359     0.400000            6         1.67
   93847.551     0.500000            7         2.00
  106168.319     0.550000            8         2.22
  117374.975     0.600000            9         2.50
  129761.279     0.650000           10         2.86
  129761.279     0.700000           10         3.33
  141033.471     0.750000           11         4.00
  141033.471     0.775000           11         4.44
  152305.663     0.800000           12         5.00
  152305.663     0.825000           12         5.71
  152305.663     0.850000           12         6.67
  164626.431     0.875000           13         8.00
  164626.431     0.887500           13         8.89
  164626.431     0.900000           13        10.00
  164626.431     0.912500           13        11.43
  164626.431     0.925000           13        13.33
  176947.199     0.937500           14        16.00
  176947.199     1.000000           14          inf
#[Mean    =    99781.486, StdDeviation   =    47651.738]
#[Max     =   176816.128, Total count    =           14]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------

  Latency Distribution (HdrHistogram - Uncorrected Latency (measured without taking delayed starts into account))
 50.000%    9961.47 ms
 75.000%    10035.20 ms
 90.000%    10076.16 ms
 99.000%    10108.93 ms
 99.900%    10108.93 ms
 99.990%    10108.93 ms
 99.999%    10108.93 ms
100.000%    10108.93 ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

    9887.743     0.000000            1         1.00
    9920.511     0.100000            2         1.11
    9936.895     0.200000            3         1.25
    9953.279     0.300000            6         1.43
    9953.279     0.400000            6         1.67
    9961.471     0.500000            7         2.00
    9969.663     0.550000            8         2.22
    9977.855     0.600000           10         2.50
    9977.855     0.650000           10         2.86
    9977.855     0.700000           10         3.33
   10035.199     0.750000           11         4.00
   10035.199     0.775000           11         4.44
   10059.775     0.800000           12         5.00
   10059.775     0.825000           12         5.71
   10059.775     0.850000           12         6.67
   10076.159     0.875000           13         8.00
   10076.159     0.887500           13         8.89
   10076.159     0.900000           13        10.00
   10076.159     0.912500           13        11.43
   10076.159     0.925000           13        13.33
   10108.927     0.937500           14        16.00
   10108.927     1.000000           14          inf
#[Mean    =     9979.026, StdDeviation   =       61.037]
#[Max     =    10100.736, Total count    =           14]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  15 requests in 3.02m, 5.22GB read
  Socket errors: connect 0, read 0, write 0, timeout 68
Requests/sec:      0.08
Transfer/sec:     29.52MB